package org.example;

public class InfoAboutService {

    public static void isInfoAboutServiceFirst(){
        System.out.println("Рады приветствовать в нашем приложении. " +
                "Наше приложении работает, исходя из указанного Вами возраста. Поэтому Вам необходимо ввести дату своего рождения, после чего на экране появится полный список компаний, которые подходят для Вашего возраста. " +
                "В дальнейшем Вы можете произвести отбор по 5-ти категориям: " +
                "1. месту нахождения компании, для чего необходимо будет ввести интересующий Вас город (на сегодня это Берлин, Мюнхен и Нюрберг)" +
                "2. по форме собственности компании, то есть сделать выбор между государственными компаниями и частными" +
                "3. по половому признаку, то есть выбрать компании, в которых обучают только мужчин, только женщин или всех желающих" +
                "4. по сфере деятельности компании, для чего надо будет написать одно из указанных при выборе данной категории в приложении значений" +
                "5. по форме работы компании, то есть, работают компании только он-лайн, только в помещении компании или же обе формы деятельностию" +
                        "Находясь в любой категории, Вы можете выйти из нее как с сохранением результата, так и без него." +
                "Также Вы можете вернуться в самое начало поиска или выйти из приложения" +
                "Для чего просим следовать инструкциям, которые будут появляться при работе с приложением." +
                "Желаем удачи!")
                ;
    }
    
    
}
